
 /----------------------------------------------------------------------------\
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |  Copyright (C) 2012 - 2024  Claire Xenia Wolf <claire@yosyshq.com>         |
 |  Distributed under an ISC-like license, type "license" to see terms        |
 \----------------------------------------------------------------------------/
 Yosys 0.46 (git sha1 e97731b9dda91fa5fa53ed87df7c34163ba59a41, clang++ 16.0.6 -fPIC -O3)
Loaded SDC plugin

-- Running command `
                    verilog_defines -DUSE_POWER_PINS;
verilog_defines -D__pnr__;
verilog_defines -DSCL_sky130_fd_sc_hd;
verilog_defines -D__librelane__;
verilog_defines -DPDK_sky130A;
read_verilog -sv -lib /Users/refikyalcin/vlsi/digital/io-ring-demo/config/runs/RUN_2025-12-18_13-59-20/tmp/673c1fce3f734d80a057132a7d5e5eec.bb.v;

                    blackbox;
                    write_verilog -noattr -noexpr -nohex -nodec -defparam -blackboxes /Users/refikyalcin/vlsi/digital/io-ring-demo/config/runs/RUN_2025-12-18_13-59-20/tmp/673c1fce3f734d80a057132a7d5e5eec.bb.v;
                    ' --

1. Executing Verilog-2005 frontend: /Users/refikyalcin/vlsi/digital/io-ring-demo/config/runs/RUN_2025-12-18_13-59-20/tmp/673c1fce3f734d80a057132a7d5e5eec.bb.v
/Users/refikyalcin/vlsi/digital/io-ring-demo/config/runs/RUN_2025-12-18_13-59-20/tmp/673c1fce3f734d80a057132a7d5e5eec.bb.v:201: ERROR: syntax error, unexpected TOK_ID
